{
    "name": "http://linksys.com/jnap/devicelist/DeviceList", 
    "desc": "This service provides information about the devices that are connected to the network, as well as those that are not currently online but have been connected to the network in the past.", 
    "actions": {
        "DeleteDevice": {
            "name": "http://linksys.com/jnap/devicelist/DeleteDevice", 
            "desc": "This action deletes a device from the device list. This is useful for \"cleaning up\" after a device is permanently removed from the network (e.g., thrown away, returned to the store). Only devices that are not currently connected to the network can be deleted. Note that if a device is deleted and subsequently rejoins the network, the device ID that is assigned to it when it is rediscovered will not necessarily be the same device ID that it had before it was deleted.", 
            "input": {
                "deviceID": {
                    "type": "UUID", 
                    "array": false, 
                    "optional": false, 
                    "desc": "The unique ID of the device that should be deleted."
                }
            }, 
            "result": {
                "errors": {
                    "Error": "", 
                    "ErrorCannotDeleteDevice": "The device cannot be deleted because it is currently connected to the network, or it is the device that hosts the device list service.", 
                    "ErrorUnknownDevice": "The specified device ID does not match any known device.", 
                    "_ErrorAbortedAction": "", 
                    "_ErrorInvalidInput": "", 
                    "_ErrorInvalidOutput": "", 
                    "_ErrorNotReady": "", 
                    "_ErrorSessionVerification": "", 
                    "_ErrorUnauthorized": "", 
                    "_ErrorUnexpected": "", 
                    "_ErrorUnknownAction": "", 
                    "_ErrorUnknownSession": ""
                }, 
                "success": {
                    "OK": "Success."
                }
            }
        }, 
        "GetDevices": {
            "name": "http://linksys.com/jnap/devicelist/GetDevices", 
            "desc": "This action returns information about some or all of the devices that are connected to the network or have been connected to it at some time in the past. The caller can optionally specify the revision number that was returned from a previous call, in order to query for changes that have occurred since that call.", 
            "input": {
                "deviceIDs": {
                    "type": "UUID", 
                    "array": true, 
                    "optional": true, 
                    "desc": "An optional list of device IDs. If this value is specified, information will be returned only for those devices whose IDs appear in the list. If this value is not specified, the returned list of devices will not be filtered by device ID. Note that if an empty array is specified for this value, the returned list of devices will always be empty; in this case, the action serves only to query the most recent revision number."
                }, 
                "sinceRevision": {
                    "type": "int", 
                    "array": false, 
                    "optional": true, 
                    "desc": "An optional revision number. If this value is specified, information will be returned only for devices that have been added, changed, or deleted since the specified revision number. If this value is not specified, the returned list of devices will not be filtered by revision number."
                }
            }, 
            "output": {
                "revision": {
                    "type": "int", 
                    "array": false, 
                    "optional": false, 
                    "desc": "The revision number corresponding to the most recent change to the device list data. Clients can use this revision number to detect whether the device's data has changed since a point in the past. Once the revision number reaches 2147483647, the next change to the device list will cause the revision number and the last revision number of every device to be reset to 0. This data is not persisted across reboots of the service's host device; after a reboot, the revision number of every device is 0."
                }, 
                "devices": {
                    "type": "Device", 
                    "array": true, 
                    "optional": false, 
                    "desc": "The list of devices, if any, that satisfy the specified filter criteria."
                }, 
                "deletedDeviceIDs": {
                    "type": "UUID", 
                    "array": true, 
                    "optional": true, 
                    "desc": "A list of the unique IDs of devices that were deleted since the revision specified by the sinceRevision input parameter. If the sinceRevision parameter was not specified, this value is not present in the output. This data is not persisted across reboots of the service's host device."
                }
            }, 
            "result": {
                "errors": {
                    "Error": "", 
                    "_ErrorAbortedAction": "", 
                    "_ErrorInvalidInput": "", 
                    "_ErrorInvalidOutput": "", 
                    "_ErrorNotReady": "", 
                    "_ErrorSessionVerification": "", 
                    "_ErrorUnauthorized": "", 
                    "_ErrorUnexpected": "", 
                    "_ErrorUnknownAction": "", 
                    "_ErrorUnknownSession": ""
                }, 
                "success": {
                    "OK": "Success."
                }
            }
        }, 
        "GetLocalDevice": {
            "name": "http://linksys.com/jnap/devicelist/GetLocalDevice", 
            "desc": "This action returns the ID for the local device.", 
            "output": {
                "deviceID": {
                    "type": "UUID", 
                    "array": false, 
                    "optional": false, 
                    "desc": ""
                }
            }, 
            "result": {
                "errors": {
                    "Error": "", 
                    "ErrorUnknownDevice": "The device does not match any known device.", 
                    "_ErrorAbortedAction": "", 
                    "_ErrorInvalidInput": "", 
                    "_ErrorInvalidOutput": "", 
                    "_ErrorNotReady": "", 
                    "_ErrorSessionVerification": "", 
                    "_ErrorUnauthorized": "", 
                    "_ErrorUnexpected": "", 
                    "_ErrorUnknownAction": "", 
                    "_ErrorUnknownSession": ""
                }, 
                "success": {
                    "OK": "Success."
                }
            }
        }, 
        "SetDeviceProperties": {
            "name": "http://linksys.com/jnap/devicelist/SetDeviceProperties", 
            "desc": "This action creates or modifies custom device properties.", 
            "input": {
                "deviceID": {
                    "type": "UUID", 
                    "array": false, 
                    "optional": false, 
                    "desc": "The unique ID of the device whose properties should be modified."
                }, 
                "propertiesToRemove": {
                    "type": "string", 
                    "array": true, 
                    "optional": true, 
                    "desc": "A list of names of the properties, if any, that should be removed. This list is evaluated before the list of properties to modify."
                }, 
                "propertiesToModify": {
                    "type": "Property", 
                    "array": true, 
                    "optional": true, 
                    "desc": "A list of name-value pairs of the properties, if any, that should be created or whose values should be modified. The number of properties that can be stored is guaranteed to be at least 16 per device, and may be more. If duplicate property names are specified, the last value in the list wins."
                }
            }, 
            "result": {
                "errors": {
                    "Error": "", 
                    "ErrorInvalidPropertyName": "One or more of the specified property names was invalid.", 
                    "ErrorPropertyValueTooLong": "One or more of the specified property values is too long.", 
                    "ErrorTooManyProperties": "The specified properties cannot be created because the number of properties would exceed the maximum allowed for the device.", 
                    "ErrorUnknownDevice": "The specified device ID does not match any known device.", 
                    "_ErrorAbortedAction": "", 
                    "_ErrorInvalidInput": "", 
                    "_ErrorInvalidOutput": "", 
                    "_ErrorNotReady": "", 
                    "_ErrorSessionVerification": "", 
                    "_ErrorUnauthorized": "", 
                    "_ErrorUnexpected": "", 
                    "_ErrorUnknownAction": "", 
                    "_ErrorUnknownSession": ""
                }, 
                "success": {
                    "OK": "Success."
                }
            }
        }
    }, 
    "structs": {
        "Property": {
            "name": {
                "type": "string", 
                "array": false, 
                "optional": false, 
                "desc": "The name of the property. Property names must be between 1 and 31 characters long, can only contain characters in the set { A-Z, a-z, 0-9, -, _, : }, and can only begin with an uppercase or lowercase letter."
            }, 
            "value": {
                "type": "string", 
                "array": false, 
                "optional": false, 
                "desc": "The value of the property, expressed as a string. Property values can be between 0 and 255 characters long, and can contain any characters except null."
            }
        }, 
        "Layer3Connection": {
            "macAddress": {
                "type": "MACAddress", 
                "array": false, 
                "optional": false, 
                "desc": "The MAC address of the connected network adapter on the device."
            }, 
            "ipAddress": {
                "type": "IPAddress", 
                "array": false, 
                "optional": true, 
                "desc": "The IPv4 address of the device's connection."
            }, 
            "ipv6Address": {
                "type": "IPv6Address", 
                "array": false, 
                "optional": true, 
                "desc": "The IPv6 address of the device's connection."
            }
        }, 
        "Device": {
            "deviceID": {
                "type": "UUID", 
                "array": false, 
                "optional": false, 
                "desc": "The unique ID associated with the device. The device list service generates this value the first time it discovers the device on the network. The same device will have different device IDs on different networks, since this value is specific to a particular instance of the device list service."
            }, 
            "lastChangeRevision": {
                "type": "int", 
                "array": false, 
                "optional": false, 
                "desc": "The revision number of the most recent change that was made to this device's data. Clients can use the revision number to decide whether or not they need to refresh their cached information of the device. This data is  notpersisted across reboots of the service's host device."
            }, 
            "model": {
                "type": "ModelInfo", 
                "array": false, 
                "optional": false, 
                "desc": "Information about the device model and version."
            }, 
            "unit": {
                "type": "UnitInfo", 
                "array": false, 
                "optional": false, 
                "desc": "Information about this particular instance of the device."
            }, 
            "isAuthority": {
                "type": "bool", 
                "array": false, 
                "optional": false, 
                "desc": "Whether the device is the authority on the local network."
            }, 
            "friendlyName": {
                "type": "string", 
                "array": false, 
                "optional": true, 
                "desc": "A \"friendly\" name for the device, as determined by the service's internal identification mechanism. This value may change when the service discovers new information about the device. This value is not modifiable by clients. Clients that want to override this name should store an override value in a property and implement business logic to check for that property before falling back to the friendly name. This value will not be present if the service is unable to determine a suitable friendly name for the device."
            }, 
            "knownMACAddresses": {
                "type": "MACAddress", 
                "array": true, 
                "optional": false, 
                "desc": "A list of MAC addresses that are known to belong to the device's network adapters. Since a single physical device may have multiple network adapters, a device may appear as multiple devices in the device list. If the service is able to detect that the two \"devices\" are in fact the same physical device, it may automatically merge the device data. Otherwise, clients can invoke the MergeDevices action in order to manually trigger a merge operation."
            }, 
            "connections": {
                "type": "Layer3Connection", 
                "array": true, 
                "optional": false, 
                "desc": "A list of the device's upstream connections to the network. If the device is currently offline, the list will be empty. If the device is online, the list will usually contain one item, since it is very rare for a device to be simultaneously connected to the same network through multiple network adapters."
            }, 
            "properties": {
                "type": "Property", 
                "array": true, 
                "optional": false, 
                "desc": "A list of custom properties associated with the device."
            }, 
            "maxAllowedProperties": {
                "type": "int", 
                "array": false, 
                "optional": false, 
                "desc": "The maximum number of properties that can be associated with the device at one time."
            }
        }, 
        "ModelInfo": {
            "deviceType": {
                "type": "string", 
                "array": false, 
                "optional": false, 
                "desc": "The category of the device. This value is designed to be used as a primary key for web services or other APIs that look up or record information about particular device models; it is not intended to be displayed to end users.\n          \n          The list of values currently in use:\n          Computer\n              A generic computer\n            Camera\n              A network-enabled camera\n            Phone\n              A cell (mobile) phone\n            GameConsole\n              A video game console, such as an XBOX\n            Printer\n              A network-attached printer\n            MediaPlayer\n              A network-attached media player, both audio and video, such as a TiVo or Sonos\n            Storage\n              A network-attached storage device\n            Printer\n              A network-attached printer\n            Infrastructure\n              A network infrastructure device, such as a router, wireless access point, bridge, etc\n            \n          The empty string indicates the category of the device is unknown."
            }, 
            "manufacturer": {
                "type": "string", 
                "array": false, 
                "optional": true, 
                "desc": "The manufacturer of the device. If this value is not present, the manufacturer of the device is unknown."
            }, 
            "modelNumber": {
                "type": "string", 
                "array": false, 
                "optional": true, 
                "desc": "The model number of the device. If this value is not present, the model number of the device is unknown."
            }, 
            "hardwareVersion": {
                "type": "string", 
                "array": false, 
                "optional": true, 
                "desc": "The hardware version of the device. If this value is not present, the hardware version of the device is unknown."
            }, 
            "description": {
                "type": "string", 
                "array": false, 
                "optional": true, 
                "desc": "A brief description of the device. If this value is not present, the device description is unknown."
            }
        }, 
        "UnitInfo": {
            "serialNumber": {
                "type": "string", 
                "array": false, 
                "optional": true, 
                "desc": "The serial number of the device. If this value is not present, the serial number of the device is unknown."
            }, 
            "firmwareVersion": {
                "type": "string", 
                "array": false, 
                "optional": true, 
                "desc": "The version number of the device's firmware. If this value is not present, the firmware version of the device is unknown."
            }, 
            "firmwareDate": {
                "type": "DateTime", 
                "array": false, 
                "optional": true, 
                "desc": "The date and time associated with the device's firmware. If this value is not present, the firmware date of the device is unknown."
            }, 
            "operatingSystem": {
                "type": "string", 
                "array": false, 
                "optional": true, 
                "desc": "The operating system running on the device."
            }
        }
    }
}